Revit 2027 API
NumberingSchema.SchemaType Property
Note: This API is now obsolete.
 Uniquly identifies this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. The NumberingSchemaType was removed. Schemas are no uniquely identified only by name. Please see the Name for a property that can replace it in usage.")]
public NumberingSchemaType SchemaType { get; }
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. The NumberingSchemaType was removed. Schemas are no uniquely identified only by name. Please see the Name for a property that can replace it in usage.")>
Public ReadOnly Property SchemaType As NumberingSchemaType
	Get
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit. The NumberingSchemaType was removed. Schemas are no uniquely identified only by name. Please see the Name for a property that can replace it in usage.")]
property NumberingSchemaType^ SchemaType {
	NumberingSchemaType^ get ();
}
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. The NumberingSchemaType was removed. Schemas are no uniquely identified only by name. Please see the Name for a property that can replace it in usage.")>]
member SchemaType : NumberingSchemaType with get
Property Value
NumberingSchemaType
Remarks
 This call has defined responses only for schemas that have in scope just one category and that category is either OST_Rebar, OST_Coupler or OST_FabricReinforcement
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace